local menu = gui.Reference("Misc", "General", "Extra")
local menu = gui.Checkbox(menu, "Aimware", "🐺打开按键列表", true);
mgWindow = gui.Window("muguoWindow", "🐺Aimware 2.0", 100, 50, 500, 500);
gui.Text( mgWindow, "------------------------------------\n按键列表\n------------------------------------\nF7\t\t绿演(触发键Mouse4)\nF8\t\t红演(合法)\nF9\t\t红演(暴力)\nF11\t\t低头摇\nF1\t\t自动穿墙\nI\t\t\t普通视觉(Fps偏低)\nO\t\t线条视觉\t(Fps大幅度提升)\nT\t\tAwp强制Baim(只对Awp有效)\nN\t\t点位助手+暴力投掷点\nH\t\t不抬头\nL\t\t鬼探头\nP\t\t假延迟\nAlt\t\t假蹲\nZXC\t左后右藏头\nshift\t慢走(不容易被抓头)\nM4\t\tautopeek\nM5\t伤害覆盖\nCap\tDT\n -----------------------------------\n更新时间：2021年12月4日\n------------------------------------\n⠄⠄⠄⢰⣧⣼⣯⠄⣸⣠⣶⣶⣦⣾⠄⠄⠄⠄⡀⠄⢀⣿⣿⠄⠄⠄⢸⡇⠄⠄\n  ⠄⠄⠄⣾⣿⠿⠿⠶⠿⢿⣿⣿⣿⣿⣦⣤⣄⢀⡅⢠⣾⣛⡉⠄⠄⠄⠸⢀⣿⠄\n ⠄⠄⢀⡋⣡⣴⣶⣶⡀⠄⠄⠙⢿⣿⣿⣿⣿⣿⣴⣿⣿⣿⢃⣤⣄⣀⣥⣿⣿⠄\n ⠄⠄⢸⣇⠻⣿⣿⣿⣧⣀⢀⣠⡌⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠿⠿⣿⣿⣿⠄\n ⠄⢀⢸⣿⣷⣤⣤⣤⣬⣙⣛⢿⣿⣿⣿⣿⣿⣿⡿⣿⣿⡍⠄⠄⢀⣤⣄⠉⠋⣰\n ⠄⣼⣖⣿⣿⣿⣿⣿⣿⣿⣿⣿⢿⣿⣿⣿⣿⣿⢇⣿⣿⡷⠶⠶⢿⣿⣿⠇⢀⣤\n ⠘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣽⣿⣿⣿⡇⣿⣿⣿⣿⣿⣿⣷⣶⣥⣴⣿⡗\n ⢀⠈⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠄\n ⢸⣿⣦⣌⣛⣻⣿⣿⣧⠙⠛⠛⡭⠅⠒⠦⠭⣭⡻⣿⣿⣿⣿⣿⣿⣿⣿⡿⠃⠄\n ⠘⣿⣿⣿⣿⣿⣿⣿⣿⡆⠄⠄⠄⠄⠄⠄⠄⠄⠹⠈⢋⣽⣿⣿⣿⣿⣵⣾⠃⠄\n ⠄⠘⣿⣿⣿⣿⣿⣿⣿⣿⠄⣴⣿⣶⣄⠄⣴⣶⠄⢀⣾⣿⣿⣿⣿⣿⣿⠃⠄⠄\n ⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿⡄⢻⣿⣿⣿⠄⣿⣿⡀⣾⣿⣿⣿⣿⣛⠛⠁⠄⠄⠄\n ⠄⠄⠄⠄⠈⠛⢿⣿⣿⣿⠁⠞⢿⣿⣿⡄⢿⣿⡇⣸⣿⣿⠿⠛⠁⠄⠄⠄⠄⠄\n ⠄⠄⠄⠄⠄⠄⠄⠉⠻⣿⣿⣾⣦⡙⠻⣷⣾⣿⠃⠿⠋⠁⠄⠄⠄⠄⠄⢀⣠⣴\n ⣿⣿⣿⣶⣶⣮⣥⣒⠲⢮⣝⡿⣿⣿⡆⣿⡿⠃⠄⠄⠄⠄⠄⠄⠄⣠⣴⣿⣿⣿ \n")

menu:SetDescription("显示功能绑定按键")

function muguo_Window()
    if(menu:GetValue() == true) then
      mgWindow:SetActive(gui.Reference("MENU"):IsActive())
    end
    if(menu:GetValue() == false) then
      mgWindow:SetActive(false)
    end
end


callbacks.Register('Draw', 'huizhif', huizhif);
callbacks.Register('Draw', 'muguo_Window', muguo_Window);
